[
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Draw a large bean shape to make the outline for the brain. Use a pencil to sketch a kidney bean shape on your paper. You can make the outline for the brain any size you like. To make the kidney bean shape, draw a circle that has an indent at the bottom. If you prefer, you could draw an oval instead, but make the middle noticeably wider than the ends. Tip: Use pencil while you're sketching since it's easy to erase mistakes.",
                "image": "https://www.wikihow.com/images/thumb/d/d5/Draw-a-Brain-Step-1-Version-4.jpg/aid466131-v4-728px-Draw-a-Brain-Step-1-Version-4.jpg"
            },
            {
                "step": "Step 2",
                "description": "Make a half-circle from the bottom that curls into the middle of the brain. To highlight a section of the cartoon brain, place your pencil on the bottom line of the outline near the center where it indents. Draw a half-circle that extends from the bottom into the center so it looks like a curlicue.if (WH.video) Remember that the brain doesn't need to look realistic since you're making a simple cartoon drawing.",
                "image": "https://www.wikihow.com/images/thumb/8/8e/Draw-a-Brain-Step-2-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-2-Version-4.jpg"
            },
            {
                "step": "Step 3",
                "description": "Draw 2 to 3 squiggly lines that connect across the brain. The brain is known for looking wrinkly and some of those wrinkles extend across the entire brain. Make a few wiggly lines that move from the outline to the half-circle you just drew or have them touch the opposite side of the brain.if (WH.video)",
                "image": "https://www.wikihow.com/images/thumb/9/9d/Draw-a-Brain-Step-3-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-3-Version-4.jpg"
            },
            {
                "step": "Step 4",
                "description": "Sketch lots of small squiggles that don't connect. These will look like wrinkles once you've made them over the entire brain. There's no need to make them all connect to each other, so make your squiggles different sizes and lengths.if (WH.video) Your lines can extend in from the outline of the brain or you can make them disconnected from the outline.",
                "image": "https://www.wikihow.com/images/thumb/a/ac/Draw-a-Brain-Step-4-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-4-Version-4.jpg"
            },
            {
                "step": "Step 5",
                "description": "Make the outline thicker to add texture to the brain. Go back and draw over some of the lines you made for the outline to make them bolder and curvy. You can also draw over some of the squiggles so they stand out.if (WH.video) You can skip this step if you want your cartoon brain to look more 2-dimensional.",
                "image": "https://www.wikihow.com/images/thumb/4/43/Draw-a-Brain-Step-5-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-5-Version-4.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Draw a horizontal oval that juts out along the bottom line. Lightly sketch an oval that's as large as you want the brain to be. Curve the top of the oval in the middle to make the rounded part of the brain. When you're drawing the bottom line, make it bump out near the middle. The bump should be about 1/3 the size of the brain's length. Keep your pencil marks light so you can erase mistakes or go over them with a pen. Tip: If it's easier for you, draw a horizontal oval and make a circle that's about 1/3 of the size of the bottom line. Place the circle on the bottom line of the oval and draw a line connecting the circle to the oval outline. Then, erase the rest of the circle.",
                "image": "https://www.wikihow.com/images/thumb/d/df/Draw-a-Brain-Step-6-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-6-Version-4.jpg"
            },
            {
                "step": "Step 2",
                "description": "Sketch a narrow curve above the top line of the brain. This will give your drawing a sense of dimension. Place your pencil on one end of the oval and draw a line that curves over the top line. It should be about 1⁄2 inch (1.3 cm) above the original outline at its widest point.if (WH.video) If you don't want to give the brain dimension, you can skip this step.",
                "image": "https://www.wikihow.com/images/thumb/a/a2/Draw-a-Brain-Step-7-Version-4.jpg/550px-nowatermark-Draw-a-Brain-Step-7-Version-4.jpg"
            },
            {
                "step": "Step 3",
                "description": "Make a curve that looks like a C on the bottom bump. Now that you've drawn the basic outline for the brain, you'll start to draw lines that separate the different segments of the brain. Locate the bump you made on the bottom line and draw the base of a C shape so it fits into the bump. Extend the top of the C towards the middle of the brain.if (WH.video) The area of the bump will be the temporal lobe.",
                "image": "https://www.wikihow.com/images/thumb/d/d8/Draw-a-Brain-Step-8-Version-3.jpg/550px-nowatermark-Draw-a-Brain-Step-8-Version-3.jpg"
            },
            {
                "step": "Step 4",
                "description": "Trace a curved line from the outline to the middle of the line you just made. To make another segment of the brain, lightly draw a line from the original top of the brain. Make it curve slightly so it connects to the middle of the line you just drew.if (WH.video) This segment that you blocked off will be the frontal lobe.",
                "image": "https://www.wikihow.com/images/thumb/b/b8/Draw-a-Brain-Step-9-Version-3.jpg/550px-nowatermark-Draw-a-Brain-Step-9-Version-3.jpg"
            },
            {
                "step": "Step 5",
                "description": "Draw 2 to 3 long curved lines across each segment of the brain. Use a light touch to make several lines for each part. Try to mimic the shape of the individual segment. For example, the frontal lobe lines should make an arc up toward the line you drew through the brain while the lines near the back and bottom of the brain should curve down toward the base.if (WH.video) You'll use these faint lines as guidelines so it's easier to make the brain's wrinkles.",
                "image": "https://www.wikihow.com/images/thumb/2/2f/Draw-a-Brain-Step-10-Version-3.jpg/550px-nowatermark-Draw-a-Brain-Step-10-Version-3.jpg"
            },
            {
                "step": "Step 6",
                "description": "Add half-moon shapes along the lines to make them look wrinkled. Instead of leaving the smooth lines, make half-moon curves along the lines. The curves can go in different directions so the brain looks bumpy. Do this for each line to give the brain its distinctive texture.if (WH.video) Remember to go back along the sliver that you drew on top of the brain. Make small curves along this to make the brain appear bumpy.",
                "image": "https://www.wikihow.com/images/thumb/c/cd/Draw-a-Brain-Step-11-Version-3.jpg/550px-nowatermark-Draw-a-Brain-Step-11-Version-3.jpg"
            },
            {
                "step": "Step 7",
                "description": "Draw a stem and horizontal half-circle at the bottom center of the brain. To make the brain stem (medulla oblongata), sketch a narrow tube that extends from the bottom of the brain at the center. You can make it go down as far as you like. Then, draw a half-circle directly to the right of the stem. Make the half-circle go almost to that end of the brain.if (WH.video) To make the cerebellum more detailed, you can fill it with thin horizontal lines. Make the lines a little wavy so they look realistic.",
                "image": "https://www.wikihow.com/images/thumb/c/c3/Draw-a-Brain-Step-12-Version-3.jpg/550px-nowatermark-Draw-a-Brain-Step-12-Version-3.jpg"
            },
            {
                "step": "Step 8",
                "description": "Use crayons, markers, or colored pencils to add color to your drawing. You can use a single color and shade in the brain to add depth or use several colors to highlight different segments of the brain. For example, use 5 or 6 colors if you'll be labeling the parts of the brain. The different colors can help the segments stand out.",
                "image": "https://www.wikihow.com/images/thumb/e/e7/Draw-a-Brain-Step-13-Version-3.jpg/aid466131-v4-728px-Draw-a-Brain-Step-13-Version-3.jpg"
            },
            {
                "step": "Step 9",
                "description": "Label the parts of the brain if you want to use it as an anatomy reference. If you're studying parts of the brain for a class, drawing the brain and labeling it is good practice. Refer to your textbook to label the: Frontal lobe Parietal lobe Temporal lobe Occipital lobe Medulla oblongata Cerebellum",
                "image": "https://www.wikihow.com/images/thumb/6/6a/Draw-a-Brain-Step-14-Version-3.jpg/aid466131-v4-728px-Draw-a-Brain-Step-14-Version-3.jpg"
            }
        ]
    }
]