[
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Know your type of headache. There are many different types of headaches, and finding out which kind you're suffering from can help you find out the best way to treat your headache. Think about the severity and duration of your headaches as well as where you feel the pain to find out what kind you have. Some common types of headaches include: Tension headaches: These are characterized by mild to moderate pain throughout the head, typically in the forehead or back of the head. Tension headaches typically last for several hours. Sinus headaches: These bring pain that stems in the face at the bridge of the nose or cheeks. They often come with nasal congestion. Sinus headaches generally last for hours and are often seasonal. Migraines: Migraines involve moderate to severe pain and are often accompanied by nausea and sensitivity to light and sound. The pain may be centered in the temples, eyes, or the back of the head. They often last a day or longer. Cluster headaches: This type involves sharp pain around one eye or one side of your head. Bouts of frequent cluster headaches can last weeks or months.",
                "image": "https://www.wikihow.com/images/thumb/4/43/Treat-a-Migraine-Step-1-Version-4.jpg/aid14093-v4-728px-Treat-a-Migraine-Step-1-Version-4.jpg"
            },
            {
                "step": "Step 2",
                "description": "Take an over-the-counter pain reliever. Most painkillers won't kick in for about 1-2 hours, so take a dose as soon as you start feeling the headache coming on. Earlier treatment is always better to address a headache. Even if you're already in the depths of misery, a quick dose of ibuprofen, acetaminophen, naproxen, aspirin or even a capsaicin nasal spray can take the edge off. Be careful not to take medications unless you’re told to by your doctor. Never take more medication, or take medication more often, than directed by the label. Everyday use of OTC medications can be linked to Medication Overuse Syndrome, where a person takes medication they don’t actually need because they’re afraid of future headaches. This misuse can actually cause frequent, recurrent headaches called “rebound headaches. If you frequently take headache medication 3+ times a week, see a doctor.",
                "image": "https://www.wikihow.com/images/thumb/0/0f/Repair-Nerve-Damage-Step-2-Version-2.jpg/aid14093-v4-728px-Repair-Nerve-Damage-Step-2-Version-2.jpg"
            },
            {
                "step": "Step 3",
                "description": "Know when to seek medical assistance immediately. If your headache includes other symptoms, it may be a sign of a more severe condition, such as stroke, encephalitis, or meningitis. See a doctor immediately or call the emergency services if your headache also includes: Trouble seeing, walking, or talking Stiff neck Nausea and/or vomiting High fever (102-104F) Fainting Difficulty using one side of your body Feelings of extreme weakness, numbness, or paralysis Also see a doctor if you have frequent or severe headaches, your medication doesn't work, or you can't function normally.",
                "image": "https://www.wikihow.com/images/thumb/1/1c/Increase-Progesterone-Levels-Step-15.jpg/aid14093-v4-728px-Increase-Progesterone-Levels-Step-15.jpg"
            },
            {
                "step": "Step 4",
                "description": "Use caffeine carefully––it can be a double-edged sword. Though caffeine (which is included in some OTC pain relievers) can initially help a headache, it can also lead to more headaches over time by developing or worsening a caffeine dependence. During headache attacks, adenosine is elevated in the bloodstream. Caffeine helps by blocking adenosine receptors. If you have frequent headaches, it’s best to avoid all caffeine whenever possible. If you're a heavy caffeine drinker (more than 200 milligrams per day, or about 2 cups of coffee) and you suddenly take it out of your diet, headaches are a common side-effect. Slowly overcome caffeine withdrawal if you consume too much and think this might be contributing to your headaches. Warning: Limit caffeine treatment of headaches to no more than twice a week. If you use caffeine to treat headaches more often than this, your body can become dependent on caffeine, especially among migraine sufferers.",
                "image": "https://www.wikihow.com/images/thumb/e/e8/Cure-a-Fever-at-Home-Step-11-Version-4.jpg/aid14093-v4-728px-Cure-a-Fever-at-Home-Step-11-Version-4.jpg"
            },
            {
                "step": "Step 5",
                "description": "Drink plenty of water. Dehydration can lead to a headache, especially if you've vomited recently or you're hungover.  Drink a tall glass of water as soon as your head starts to hurt, and try to continue drinking small sips throughout the day. You may gradually feel the pain start to ease. For men, drink at least 13 cups (3 liters) of water a day. For women, drink at least 9 cups (2.2 liters) of water a day. You should drink more if you exercise frequently, live in a hot or humid environment, have an illness that causes vomiting or diarrhea, or are breastfeeding. Another way to calculate your daily water needs is by weight; every day, you should try to drink between 0.5 and 1 ounce of water for every pound that you weigh. Don’t drink water that’s too cold if you already have a headache. Extremely cold or iced water can trigger migraines in some people, especially if they’re already prone to migraine headaches. Room-temperature water is a better option.",
                "image": "https://www.wikihow.com/images/thumb/6/67/Get-Rid-of-Love-Handles-%28for-Men%29-Step-5.jpg/aid14093-v4-728px-Get-Rid-of-Love-Handles-%28for-Men%29-Step-5.jpg"
            },
            {
                "step": "Step 6",
                "description": "Find a quiet, dark place to take a break. If you can, try to lie down and relax for at least 30 minutes. Shut the blinds, turn off the lights, and focus on your breathing. This sensory reduction can help you relax and heal. If you'd like, get some sleep or take a short nap. If you're forced to rest around other people, explain that you have a headache and ask that they please try to be quiet and leave you undisturbed. Pre-emptively asking for cooperation can help you avoid an ugly interruption later. Make sure your bed or couch is comfortable and that your head is supported in a position that doesn't increase the tension to your neck. If one side of your neck is stretched and the other is cramped, adjust your position so that your head and neck are evenly supported. Avoid bright, unnatural light, as light makes headaches worse -- even for blind people. You can also wear an eye mask to block out light. Some people can only relax in a cool room, while others prefer a large blanket or a space heater. Try to create whatever conditions work best for you when you go to sleep at night.",
                "image": "https://www.wikihow.com/images/thumb/8/88/Get-More-REM-Sleep-Step-4-Version-2.jpg/aid14093-v4-728px-Get-More-REM-Sleep-Step-4-Version-2.jpg"
            },
            {
                "step": "Step 7",
                "description": "Practice progressive muscle relaxation.  Progressive muscle relaxation can help ease headache pain. Other exercises focused on relaxation, such as gentle yoga or meditation, can also help. Begin progressive muscle relaxation by lying down in a comfortable position. Close your eyes and breathe deeply. Beginning at your forehead, tense all the muscles in a specific group for 5 seconds. Relax the muscles and focus on the feeling of release that you experience in your muscles. Then, move to the next group of muscles. Muscle groups to tense and relax include: forehead, eyes and nose, lips-cheeks-jaw, hands, arms, shoulders, back, stomach, hips and buttocks, thighs, feet, and toes.",
                "image": "https://www.wikihow.com/images/thumb/1/1c/Choose-Between-Yoga-Vs-Pilates-Step-10.jpg/aid14093-v4-728px-Choose-Between-Yoga-Vs-Pilates-Step-10.jpg"
            },
            {
                "step": "Step 8",
                "description": "Use a cool compress. Placing something soft and cool over your forehead and eyes can help the blood vessels constrict, which will reduce inflammation and may ease your headache pain. This works particularly well if the problem is concentrated in your temples or sinuses. To make a cool compress, wet a washcloth with cool water and lay it over your forehead. Refresh it with more cold water as soon as it starts to feel uncomfortably warm. Alternatively, put a wet washcloth in a resealable plastic sandwich bag and place the bag in the freezer for 30 minutes. Remove it and place on your forehead for a long-lasting compress. Tip: If you have a tension headache, which may be caused by stress, anxiety, or sore muscles, a warm compress may help relieve the pain more effectively than a cold compress.",
                "image": "https://www.wikihow.com/images/thumb/9/9f/Cure-Nausea-Step-19-Version-5.jpg/728px-Cure-Nausea-Step-19-Version-5.jpg"
            },
            {
                "step": "Step 9",
                "description": "Massage your face and scalp. Particularly if you suffer from tension headaches, massage can help improve circulation and relieve tension, which will help relieve the pain of your headache. Tension headaches can be caused by a variety of things, from poor posture to jaw clenching to strained muscles. Anxiety and depression may also trigger tension headaches. To massage your temples, place your thumbs on the soft spot between your upper ear and the corner of your eye. Keeping your thumbs on your temples, use very firm pressure and move your fingers in small, circular motions from your temple to the center of your forehead. Gently massaging the bridge of your nose can help relieve sinus and migraine headaches. Hop in a hot shower and treat yourself to a long scalp massage as you shampoo your hair. Or, for a drier version, pour a little bit of coconut or argan oil on your fingers and rub them into your scalp.",
                "image": "https://www.wikihow.com/images/thumb/3/3b/Cure-Nausea-Step-4-Version-5.jpg/aid14093-v4-728px-Cure-Nausea-Step-4-Version-5.jpg"
            },
            {
                "step": "Step 10",
                "description": "Massage your neck and shoulders. Tension in your neck and shoulders can cause headaches. Fortunately, although tension headaches are the most common type of headache they’re also one of the easier headaches to treat. To massage your neck and shoulders, sit and place your hands on your shoulders with your fingers pointed toward your shoulder blades. Exhale and relax your neck, letting your head fall backward. Squeeze your fingers to apply pressure on your shoulder muscles. Move your fingers in small, deep circular movements toward the base of your skull. Interlace your fingers behind your head. Allow your head to drop forward, letting the weight of your arms gently stretch the muscles of your neck and shoulders. Variation: Instead of massaging your neck and shoulders, find 2 tennis balls or racquetballs and put them in a sock. Lie on a flat surface and place the 2 balls just below the base of your skull and relax. You may feel sinus pressure or minimal discomfort at first but it will go away.",
                "image": "https://www.wikihow.com/images/thumb/9/90/Keep-Composure-Step-7.jpg/aid14093-v4-728px-Keep-Composure-Step-7.jpg"
            },
            {
                "step": "Step 11",
                "description": "Do neck exercises.  Stretching and strengthening your neck muscles can help relieve chronic headaches, but they may help in the moment as well.  Here is a simple routine to stretch your neck muscles: Slowly lower your chin to your chest without moving your shoulders.  You should feel the stretch in the back of your neck. Return your head to the upright position. Slowly twist your head to one side. Hold for 15-30 seconds.  Return to facing forward, then repeat, looking the other direction. Return to looking straight ahead of you. Slowly lower your head so that your ear is approaching your shoulder (but do not lift the shoulder). Hold for 15-30 seconds. Lift your head to the upright position, then lower your other ear towards the shoulder and hold for 15-30 seconds. Do not stretch to the point of pain.  Repeat exercises as necessary.",
                "image": "https://www.wikihow.com/images/thumb/9/9c/Get-Rid-of-a-Nerve-Pinch-in-Your-Neck-Quickly-Step-6.jpg/aid14093-v4-728px-Get-Rid-of-a-Nerve-Pinch-in-Your-Neck-Quickly-Step-6.jpg"
            },
            {
                "step": "Step 12",
                "description": "Use acupressure techniques. Acupressure may help you relieve tension and headache pain, especially if your headaches are caused by muscle tension or stress. Stimulating acupressure points in your neck, shoulder, and hands can help relieve headaches. Behind your ear: Locate the mastoid bone just behind your ear, and follow the natural groove in your neck to where the muscles attach to the skull. Apply deep, very firm pressure for 4-5 seconds while you breathe deeply. On your shoulder: Locate the point on your shoulder muscle about halfway between your neck and the edge of your shoulder. Using your opposite hand (right hand on the left shoulder, left hand on the right shoulder), pinch the shoulder muscle between your fingers and thumb. Use your index finger to apply firm downward pressure for 4-5 seconds. On your hand: Massage the soft part of your hand in between your index finger and thumb. Apply firm, circular pressure for 4-5 seconds. However, this should be avoided during pregnancy because it might induce labor. On your back: Place ping pong balls in a sock and lean back against a chair (or the seat of a car), placing the balls between the seat and your back to activate pressure points.",
                "image": "https://www.wikihow.com/images/thumb/f/f3/Get-Rid-of-a-Nerve-Pinch-in-Your-Neck-Quickly-Step-1-Version-2.jpg/aid14093-v4-728px-Get-Rid-of-a-Nerve-Pinch-in-Your-Neck-Quickly-Step-1-Version-2.jpg"
            },
            {
                "step": "Step 13",
                "description": "Practice relaxation techniques.  People around the world use a variety of tricks to distract themselves from pain.  If you're in the midst of a headache, don't worry about learning something new — stick to whatever is closest to your comfort zone. Some popular options include: Meditation. Prayer. Deep breathing. Visualization. Listening to binaural beats. Try to just calm down. If you can fall asleep, that might help.",
                "image": "https://www.wikihow.com/images/thumb/4/43/Control-Your-Thoughts-Step-11.jpg/aid14093-v4-728px-Control-Your-Thoughts-Step-11.jpg"
            },
            {
                "step": "Step 14",
                "description": "Use breathing exercises. Sometimes, breathing itself can be a cure. It sounds obvious because breathing is just something we do, but relaxation and deep breathing can actually be something that you need to focus on. Deep, regular breathing can remove tension and relax you and your headache in minutes. To try a breathing exercise, find a cool, dark, quiet place. Make yourself comfortable. You can lie down or sit comfortably and remove or loosen tight clothing. Inhale slowly through your nose. You should feel your abdomen expanding as you fill your lungs with air. Hold for 2-3 seconds, then exhale slowly through your mouth until your lungs feel empty.",
                "image": "https://www.wikihow.com/images/thumb/4/4b/Perform-Mantra-Meditation-Step-6-Version-2.jpg/aid14093-v4-728px-Perform-Mantra-Meditation-Step-6-Version-2.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Use natural remedies with caution. There are some natural remedies that might work to treat your headache. As with any natural remedy, always know the side effects and allergy potential of the remedy, as well any times you should not use the remedy (such as while pregnant, if you’re already sick, etc.). Be aware that natural remedies are often not backed with scientific research or approved by the FDA or other licensing agencies.",
                "image": "https://www.wikihow.com/images/thumb/3/32/Flush-Your-Kidneys-Step-3.jpg/aid14093-v4-728px-Flush-Your-Kidneys-Step-3.jpg"
            },
            {
                "step": "Step 2",
                "description": "Try herbal remedies. Look for standardized herbal supplements that contain a specified amount of the active ingredient in every dose. There are several herbal remedies that are considered to have value for getting rid of headaches. Note, however, that the scientific support for or extensive studies on the effectiveness of many of these supplements varies. As with any treatment, use with caution, and stop using them immediately if you experience unpleasant side-effects. Herbal Remedies to TryButterbur: To reduce migraine frequency, take butterbur supplements (as the plant itself contains toxic elements that are removed when it's made into capsules).Ginger: In addition to treating headache pain, ginger can help treat nausea and vomiting, which are common side-effects of a severe headache.Coriander: Coriander seeds can be used to decrease the inflammation that causes headaches.Tea: A cup of tea made from passion flower, rosemary, willow, or lavender might alleviate a headache.",
                "image": "https://www.wikihow.com/images/thumb/6/62/Control-Asthma-Without-Medicine-Step-22.jpg/aid14093-v4-728px-Control-Asthma-Without-Medicine-Step-22.jpg"
            },
            {
                "step": "Step 3",
                "description": "Use aromatherapy. Aromatherapy preparations vary considerably, but some of the more commonly used essential oils for headache treatment include lavender, sweet marjoram, and chamomile. Use for neck massaging, in a bath, or to inhale. For the relief of aches and pains: Mix five drops rosemary oil, five drops nutmeg oil, five drops lavender oil in a carrier oil such as olive or coconut oil. Massage onto the neck and upper back area.",
                "image": "https://www.wikihow.com/images/thumb/6/69/Stop-Scratching-a-Mosquito-Bite-Step-10.jpg/aid14093-v4-728px-Stop-Scratching-a-Mosquito-Bite-Step-10.jpg"
            },
            {
                "step": "Step 4",
                "description": "Use food-based remedies. Lack of food can cause a headache, so make sure you've eaten something recently. Some foods and beverages may also trigger headaches (red wine, MSG, and chocolate are common culprits). Be mindful of what you eat, and don’t eat foods that you notice routinely cause headaches. You may also be able to help treat headache pain by eating certain foods. Tip: To relieve your headache, eat foods that contain magnesium, such as almonds, bananas, cashews, and avocados; hot, spicy foods, such as peppers and chilis; and nutrient-dense foods, including dark, leafy greens like spinach.",
                "image": "https://www.wikihow.com/images/thumb/0/06/Cure-a-Fever-at-Home-Step-25-Version-2.jpg/aid14093-v4-728px-Cure-a-Fever-at-Home-Step-25-Version-2.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Get plenty of sleep.  Having good \"sleep hygiene\"-- getting plenty of good quality sleep-- can help you feel better generally and can reduce headache occurrences.  Adults should get at least 7-8 hours of sleep each night. If you have trouble sleeping, try some of the following techniques: Limit your \"screen time\" before bed Only use your bed for sleep and intimacy Limit caffeine consumption in the later part of the day Begin dimming the lights and giving yourself time to \"wind down\" before preparing for bed",
                "image": "https://www.wikihow.com/images/thumb/8/83/Cure-a-Fever-at-Home-Step-4-Version-3.jpg/aid14093-v4-728px-Cure-a-Fever-at-Home-Step-4-Version-3.jpg"
            },
            {
                "step": "Step 2",
                "description": "Limit your exposure to fragrances.  Though perfume and scented products such as soaps and lotions might make you smell nice, they could be causing your headaches.  Try switching to unscented products and ask those to whom you spend a lot of time in proximity to do the same. Remove or unplug scented air fresheners from your living or working space as well.",
                "image": "https://www.wikihow.com/images/thumb/5/50/Look-Rich-Without-Being-Rich-%28for-Teens%29-Step-3-Version-2.jpg/aid14093-v4-728px-Look-Rich-Without-Being-Rich-%28for-Teens%29-Step-3-Version-2.jpg"
            },
            {
                "step": "Step 3",
                "description": "Change your diet. Although this won't alleviate your headache straight away, making dietary changes in the longer term can potentially remove a source of headaches for you in the future. If you don't know where to begin, see your doctor or a dietician/nutritionist. Find out whether you have any particular food allergies and eliminate those foods from your diet. Reduce your intake of caffeine. Caffeine can induce headaches. Ironically, withdrawal from caffeine will probably cause a temporary headache, but once you're through the withdrawal period, you'll notice a positive difference. You might consider avoiding or minimizing potential headache-triggering foods, especially those containing MSG, nitrites, and nitrates (cured meats), tyramines (aged cheese, wine, beer, and processed meats), sulphites (dried fruits, condiments, and wine), and salicylates (tea, vinegar, and some fruit).",
                "image": "https://www.wikihow.com/images/thumb/3/34/Get-More-Testosterone-Step-18.jpg/aid14093-v4-728px-Get-More-Testosterone-Step-18.jpg"
            },
            {
                "step": "Step 4",
                "description": "Treat musculoskeletal problems. If your back or neck are misaligned, or you're suffering from poor posture and muscle tension, it's important to fix this source of pain. While you can try to improve your musculoskeletal problems through exercise such as stretching, yoga, or pilates, it is usually important to also see a specialist such as a physiotherapist or a chiropractor to assess and treat your condition.",
                "image": "https://www.wikihow.com/images/thumb/8/82/Treat-Upper-Back-Pain-Step-7-Version-2.jpg/aid14093-v4-728px-Treat-Upper-Back-Pain-Step-7-Version-2.jpg"
            },
            {
                "step": "Step 5",
                "description": "Do yoga. Yoga aimed at reducing tension can remove or minimize headaches and prevent them from reoccurring. Simple neck rolling or relaxation yoga exercises are best.",
                "image": "https://www.wikihow.com/images/thumb/c/cd/Reduce-Hips-by-Yoga-Step-2-Version-3.jpg/aid14093-v4-728px-Reduce-Hips-by-Yoga-Step-2-Version-3.jpg"
            },
            {
                "step": "Step 6",
                "description": "Set up an ergonomically correct workstation. The way that you're sitting at the desk and using a computer might be contributing to your headache. Be sure that everything is at the right height and distance for your size. Make sure you can keep your neck in a neutral position while you work. We often end up slouching and pushing our necks out of alignment when using computers and other digital devices. If your neck is usually bent forward, move your computer so that you can look straight ahead while working. Take regular breaks from all desk work and computer use. Exercise your eyes by looking at different distances for a few minutes every hour and do some basic body stretches.",
                "image": "https://www.wikihow.com/images/thumb/1/1d/Be-a-Smart-Student-Step-2-Version-2.jpg/aid14093-v4-728px-Be-a-Smart-Student-Step-2-Version-2.jpg"
            },
            {
                "step": "Step 7",
                "description": "See a range of health professionals. Many health issues can cause headaches, so if your headaches continue to be a problem for you, seeing specialists to address other problems can help you reduce your headaches. Choosing a Specialist:See your dentist if you clench your teeth or have jaw misalignment, tooth decay, abscesses, or post-extraction infection, these can be a source of headaches.See your optician if you need glasses but don't have a prescription. Your eyestrain could be causing unnecessary headaches.See your ear, nose and throat specialist if you have untreated infections, perforations, or other problems with your ears, nose, and throat, these could cause headaches.",
                "image": "https://www.wikihow.com/images/thumb/9/97/Deal-With-Unexplained-Pains-Step-24.jpg/aid14093-v4-728px-Deal-With-Unexplained-Pains-Step-24.jpg"
            },
            {
                "step": "Step 8",
                "description": " Calm down. If you're angry, irritable, frustrated, etc., you may be building up daily muscle tension to a point where it has become unmanageable and caused headaches. Anxiety, stress, and depression can also cause headaches. Seek professional counseling or psychological help for mapping out some fruitful ways to manage your emotions if they're dominating your approach to life every day. If you clench your jaw or grit your teeth, make an effort to relax your face. Try yawning to reduce facial tension. Practice relaxation exercises before stress-producing events like exams, getting married, taking a driver's test, etc.",
                "image": "https://www.wikihow.com/images/thumb/4/45/Be-Calm-Step-18.jpg/aid14093-v4-728px-Be-Calm-Step-18.jpg"
            },
            {
                "step": "Step 9",
                "description": "Keep a record of your headaches. This will help you to identify patterns that bring about headaches, such as after a particularly stressful period at work, after communication problems, after eating certain foods, starting your period, etc. Once you know what triggers your headaches, you can start learning to head off a headache before it even begins to develop. This information can also be very helpful to your doctor if you experience frequent headaches. Bring your headache journal along with you to doctor’s appointments.",
                "image": "https://www.wikihow.com/images/thumb/2/2e/Be-Adventurous-Step-13.jpg/aid14093-v4-728px-Be-Adventurous-Step-13.jpg"
            },
            {
                "step": "Step 10",
                "description": "Quit smoking. If you’re a smoker, you may be aggravating your headaches. Cigarette smoke contains substances that are known to cause headaches, such as carbon monoxide. Cigarettes also contain things like nicotine that constrict blood vessels, causing headaches, and also keep the liver from being able to process headache medication.  Quitting smoking can help you get fewer headaches, especially if you get “cluster headaches,” or headaches that occur in intense cycles throughout the day. Studies have shown that people who cut their tobacco use also cut their headache frequency in half. Headaches can also be caused by exposure to second-hand smoke, especially if you have a smoke allergy or sensitivity. If you don’t smoke but frequently are in places where cigarette smoke is common, you may still experience headaches.",
                "image": "https://www.wikihow.com/images/thumb/2/2d/Be-a-Man-Step-9-Version-2.jpg/aid14093-v4-728px-Be-a-Man-Step-9-Version-2.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Identify the type of headache you're experiencing. Most headaches are tension or lifestyle induced and aren't harmful, even though they're painful and can prevent you from fulfilling your tasks. If you experience frequent headaches, a severe headache, a headache that won't respond to analgesics, or a headache that is accompanied by other symptoms, consult your doctor or health professional for immediate investigation and a proper diagnosis. There's a wide variety of possible causes, which is why it's so important to seek further treatment if your headache issue doesn't resolve.",
                "image": "https://www.wikihow.com/images/thumb/d/d3/Be-a-Man-Step-5-Version-2.jpg/aid14093-v4-728px-Be-a-Man-Step-5-Version-2.jpg"
            },
            {
                "step": "Step 2",
                "description": "Prevent a tension headache by reducing stress. Tension headaches are the most common type of headache. Usually, they aren't as painful as other headaches, but they can last for hours or even days. A tension headache tends to form as a result of muscle contraction and is commonly felt like a band behind the eyes and across the forehead. A headache may be dull or recurrent if the source is not dealt with, and can be accompanied by feeling generally unwell, especially if the sufferer also has anxiety or depression. This type of headache tends to respond well to painkillers, rest, and alleviation of the source of stress. Massage, acupuncture, yoga, and relaxation therapies are good ways of preventing tension headaches. \"Talk therapy,\" where you work on your anxiety and stress with a mental health professional, can also help prevent and reduce tension headaches.",
                "image": "https://www.wikihow.com/images/thumb/3/33/Cope-when-No-One-Cares-About-You-Step-13-Version-2.jpg/aid14093-v4-728px-Cope-when-No-One-Cares-About-You-Step-13-Version-2.jpg"
            },
            {
                "step": "Step 3",
                "description": "Prevent migraine headaches with exercise. Migraines may be genetically linked, although researchers are not certain exactly what causes migraines. Migraines cause throbbing pain accompanied by severe nausea and possible vomiting. There are sometimes visual problems—called \"aura\"— such as seeing stars, flickering objects, and even partial loss of vision. Some migraines also cause numbness or weakness. Migraines can be caused by reactions to food, stressors, hormonal changes, an accident, medications, or other unknown triggers. Migraines require special medical attention If you frequently experience them, see a doctor. Regular exercise, especially aerobic exercise, can help you prevent migraine headaches by reducing tension in your body. Obesity may also be a migraine trigger, so exercise can also help prevent migraines by helping you stay at or reach a healthy weight. Warm up gradually before you exercise! Intense or sudden physical exertion without a gradual warm-up period can trigger migraines. Even brisk sexual activity can trigger a migraine in the very sensitive. Migraine headaches can also benefit from increased water consumption and a balanced diet.",
                "image": "https://www.wikihow.com/images/thumb/9/9d/Heal-Your-Life-Step-6.jpg/aid14093-v4-728px-Heal-Your-Life-Step-6.jpg"
            },
            {
                "step": "Step 4",
                "description": "Manage a cluster headache by avoiding alcohol and nicotine. Researchers don't know exactly what causes cluster headaches, so you can't prevent the first onset of a cluster headache. Cluster headaches are one of the most painful headaches, with intense pain around your eye area (usually on one side of your head). They can also involve drooping eyelids, nasal discharge and watery eyes. If this type of head pain is occurring, take it seriously and see your doctor for advice and treatment. There are some drugs and treatments that can alleviate the symptoms. Avoiding alcohol and nicotine can help reduce your risk of future cluster headaches, although it may not have any effect on your pain while a cluster headache is occurring. Oxygen therapy, where you breath in oxygen through a mask, has proven especially helpful for cluster headaches. Studies have shown that taking 10 milligrams of melatonin before bed may reduce the frequency of cluster headache onset. This may be because cluster headaches can occur when your sleep cycle is disturbed.",
                "image": "https://www.wikihow.com/images/thumb/e/e4/Sleep-With-a-Snoring-Partner-Step-8.jpg/aid14093-v4-728px-Sleep-With-a-Snoring-Partner-Step-8.jpg"
            },
            {
                "step": "Step 5",
                "description": "Prevent a medication overuse headache (MOH) by monitoring your painkiller use. The medication overuse headache (MOH), or \"rebound headache\", stems from withdrawal symptoms from the long-term use of pain relief medication (usually for tension headaches). MOH headaches are treatable. In most cases, just stop using the medication and your headaches should stop within a few days. The symptoms of an MOH headache are often similar to those of tension headaches. Avoid using headache painkillers, even over-the-counter types, for more than 2 or 3 days per week. If your symptoms are severe enough to require more frequent medication, see a doctor. Use over-the-counter painkillers no more than 15 days per month. Avoid painkillers that contain opioids (codeine, morphine, hydrocodone, etc.) or butalbital (Fioricet, Ezol, Phrenilin, etc.).",
                "image": "https://www.wikihow.com/images/thumb/4/49/Prevent-Spotting-on-Birth-Control-Step-1-Version-3.jpg/aid14093-v4-728px-Prevent-Spotting-on-Birth-Control-Step-1-Version-3.jpg"
            },
            {
                "step": "Step 6",
                "description": "Prevent a hangover headache by drinking water. Hangover headaches are very common, and they're estimated to cost the US about $148 billion a year in lost productivity (from sufferers who call out sick or do a terrible job at work because they're hungover). Symptoms include throbbing pain, nausea, and feeling generally lousy. The only guaranteed way to prevent a hangover headache is not to drink, but staying hydrated by drinking plenty of water can help you avoid the pain of an alcohol-induced headache the next day. Other liquids, including sports drinks or even broth, can also be helpful. Avoid alcohol (obviously) and beverages that include caffeine. Alcohol and caffeine both dehydrate you. Tip: A good rule of thumb is to drink 4 times as much water as you do alcohol. Since many cocktails contain between 1-2 ounces of liquor, you should plan to drink a full, large glass of water for each alcoholic beverage you consume.",
                "image": "https://www.wikihow.com/images/thumb/3/3d/Treat-a-Hangover-Step-12-Version-2.jpg/aid14093-v4-728px-Treat-a-Hangover-Step-12-Version-2.jpg"
            },
            {
                "step": "Step 7",
                "description": "Prevent an allergy or food-induced headache by knowing your triggers. Allergies and sensitivities can cause nasty headaches that often include a runny nose, watery eyes, and an itching or burning sensation as well as headache pain. Some allergies are seasonal, such as pollen allergies, and can be treated with antihistamines. You might also have a food allergy or sensitivity, which can trigger headaches. If you have frequent headaches with symptoms like itching or watery eyes, consider having an allergy skin test done by a medical professional. These tests expose you (safely!) to a variety of allergy triggers and can help determine whether your headaches are caused by things you're exposed to. MSG can sometimes induce headaches.  Someone with an MSG sensitivity may also experience facial pressure, chest pain, burning sensation on trunk, neck and shoulders and throbbing head. Nitrites and nitrates in meat can induce a moderate to severe headache. If you eat ice cream or drink a cold drink too quickly, you can induce a temporary \"brain freeze\" or \"ice cream headache\" which is severe but passes quickly.",
                "image": "https://www.wikihow.com/images/thumb/9/90/Heal-the-Lungs-Naturally-Step-25.jpg/aid14093-v4-728px-Heal-the-Lungs-Naturally-Step-25.jpg"
            },
            {
                "step": "Step 8",
                "description": "Prevent other headaches by changing your personal care routine. Headaches can sometimes be caused by eyestrain, hunger, strained neck or back muscles, and even by things like wearing your hair in a certain style (such as in a tight ponytail or wearing a headband that puts pressure behind your ears). These headaches are likely to have similar symptoms to tension headaches. Making minor changes to your routine, like setting up an ergonomically correct workstation or not wearing your hair in a tight ponytail or bun, can help prevent these headaches. Eating on a regular schedule can also help prevent everyday headaches. If you don't eat regularly, your blood sugar drops, and this can trigger intense headaches and nausea. Avoiding processed foods may also help reduce your headaches and make you feel better in general. Be sure that you follow a regular sleep schedule and get at least 7-8 hours of sleep every night.",
                "image": "https://www.wikihow.com/images/thumb/7/7b/Lose-10-Pounds-in-1-Week-without-Any-Pills-Step-5-Version-2.jpg/aid14093-v4-728px-Lose-10-Pounds-in-1-Week-without-Any-Pills-Step-5-Version-2.jpg"
            }
        ]
    }
]