[
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Spray the inner portion of your hat with warm water. Take an empty spray bottle and mist the crown and inner band of the hat with lukewarm water. Don’t worry about spraying the bill or brim of the hat. Depending on what the hat is made of, spritzing water on those areas could do more harm than good. For example, if the inside of the hat's brim is made of cardboard, the water might end up damaging the hat altogether. This method works best with baseball caps, straw hats, and cloth hats (like cotton and felt hats).",
                "image": "https://www.wikihow.com/images/thumb/7/72/Stretch-a-Hat-Step-1.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-1.jpg"
            },
            {
                "step": "Step 2",
                "description": "Dry the hat partially using a blow dryer on high heat. Turn on the blow dryer to the highest heat level and move it around so it dries out the inside of the hat. Keep the blow dryer on until the hat is just slightly damp. Be sure to dry off all the crevices and creases of the hat as you go. Check to make sure that the hat isn’t dripping wet before you continue.",
                "image": "https://www.wikihow.com/images/thumb/5/52/Stretch-a-Hat-Step-2.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-2.jpg"
            },
            {
                "step": "Step 3",
                "description": "Place the hat on your head and allow it to dry. Wear the hat so the material adjusts to the size of your head. This is the most important step, as the damp hat material is now malleable enough to widen around the circumference of your head. Wait for the hat dry as you wear it before taking it off. Don’t use a blow dryer during this part of the process.",
                "image": "https://www.wikihow.com/images/thumb/a/ab/Stretch-a-Hat-Step-3.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-3.jpg"
            },
            {
                "step": "Step 4",
                "description": "Check to see if the hat is wider. Wait until the hat has air-dried before trying it on again. With any luck, the hat will fit your head more comfortably without any extra effort or stretching. If it still feels tight, repeat the process again and see if that helps.",
                "image": "https://www.wikihow.com/images/thumb/9/9a/Stretch-a-Hat-Step-4.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-4.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Place a soccer ball inside of a plastic bag. Take an unused plastic bag and cover a soccer ball with it. Since the ball will be going inside of the fitted hat, you don’t want any dirt or grime from the ball to be getting inside of your hat. This method works best with fitted, non-adjustable baseball caps or other similar headwear. If your soccer ball is too big for your hat to fit on, consider purchasing a smaller one at a sports equipment store. You can also use any type of small, spherical ball that can be inflated, like a volleyball or basketball.",
                "image": "https://www.wikihow.com/images/thumb/2/27/Stretch-a-Hat-Step-5.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-5.jpg"
            },
            {
                "step": "Step 2",
                "description": "Put the bagged soccer ball inside of your hat. Slide the bagged soccer ball into the crown of the hat. Fit it in as snugly as possible, since this will be the item that enlarges your hat from the inside. Make sure that the inflation point of the ball is accessible, since you’ll be needing it in a moment.",
                "image": "https://www.wikihow.com/images/thumb/8/8a/Stretch-a-Hat-Step-6.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-6.jpg"
            },
            {
                "step": "Step 3",
                "description": "Plug a tire pump into the ball and pump it up. Stick the inflation needle of the tire pump into the soccer ball and push the handle up and down to fill the ball with air. The hat should slowly expand as the ball inflates. Don’t pump too much or too quickly, as you don’t want the ball to get damaged in the inflation process. Keep pumping until the hat feels tight around the soccer ball.",
                "image": "https://www.wikihow.com/images/thumb/3/30/Stretch-a-Hat-Step-7.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-7.jpg"
            },
            {
                "step": "Step 4",
                "description": "Let the soccer ball stay in the hat overnight to stretch out. Leave the inflation pump connected to the soccer ball overnight, as it will help the soccer ball keep its shape within the hat. The next day, remove the bagged soccer ball from the hat and see if the hat’s circumference feels any wider. If not, repeat the process. If you try this method again, consider deflating the soccer ball slightly so it can have the same enlarging effect each time.",
                "image": "https://www.wikihow.com/images/thumb/f/fe/Stretch-a-Hat-Step-8.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-8.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Blow up a balloon and put your hat on it. Take a party balloon and fill it with air. As you're filling it, stick your hat on the balloon so it begins to expand as well. Keep filling the balloon until it reaches its maximum capacity. Make sure you’re using a latex balloon and not a helium party balloon. This works best with hats made of soft material, like wool.",
                "image": "https://www.wikihow.com/images/thumb/3/39/Stretch-a-Hat-Step-9.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-9.jpg"
            },
            {
                "step": "Step 2",
                "description": "Mix baby shampoo with some lukewarm water. Take 1 teaspoon (4.9 mL) of baby shampoo and stir it into at least 0.5 cups (120 mL) of warm water. Pour the solution into a small spray bottle. The shampoo and water amounts don’t have to be exact—just make sure that you have a sudsy mixture in the bottle. You can use regular conditioner if you don’t have baby shampoo lying around.",
                "image": "https://www.wikihow.com/images/thumb/1/1c/Stretch-a-Hat-Step-10.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-10.jpg"
            },
            {
                "step": "Step 3",
                "description": "Spray the hat lightly with the mixture. Spritz the surface of the material with the shampoo solution. While you want to coat all of the hat, make sure that you’re not drenching the material. Aim for it to be moist, but not wet. Make sure your bottle has a mist setting, if possible. Misting the solution will prevent the hat from getting drenched.",
                "image": "https://www.wikihow.com/images/thumb/d/dd/Stretch-a-Hat-Step-11.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-11.jpg"
            },
            {
                "step": "Step 4",
                "description": "Tug the hat to continue stretching it over the balloon. Keep pulling on the edges of the hat to stretch it, so that more of the balloon’s surface is covered by the material. This encourages the material to stretch, and helps your hat to mimic the shape of the balloon more accurately. While you want to stretch out the hat, you don’t want the balloon to pop in the process.",
                "image": "https://www.wikihow.com/images/thumb/d/dd/Stretch-a-Hat-Step-12.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-12.jpg"
            },
            {
                "step": "Step 5",
                "description": "Allow the hat to air-dry on the balloon overnight. Wait at least one night for your hat to dry completely. Once the hat is no longer damp to the touch, remove the balloon. Try the hat on and see if the material feels stretchier than before. If it still feels too tight, you can try the process again.",
                "image": "https://www.wikihow.com/images/thumb/3/3c/Stretch-a-Hat-Step-13.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-13.jpg"
            }
        ]
    },
    {
        "Part": [
            {
                "step": "Step 1",
                "description": "Place a wooden hat stretcher into your hat. Hat stretchers, also called hat jacks, help to push gently along the sides of a hat without damaging the material in the process. This method works best with fitted hats, like cowboy hats and baseball caps.",
                "image": "https://www.wikihow.com/images/thumb/f/f3/Stretch-a-Hat-Step-14.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-14.jpg"
            },
            {
                "step": "Step 2",
                "description": "Turn the center knob clockwise to tighten the hat stretcher. Pinch the center knob of the hat jack and begin rotating it in a right, or clockwise, direction. Since you don’t want to overstretch your hat, twist the knob slowly so the hat expands gradually.",
                "image": "https://www.wikihow.com/images/thumb/8/8e/Stretch-a-Hat-Step-15.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-15.jpg"
            },
            {
                "step": "Step 3",
                "description": "Apply some steam beneath the brim of the hat. Take a clothes iron or tea kettle and squeeze out a consistent stream of steam beneath the brim of the hat. Aim for the steam to touch the inner circumference of your headwear. Depending on the style, this part of the hat might have some sort of leather band going around, which may be making the hat feel tighter than it should be. Continue applying steam to loosen this area, thus expanding the hat’s circumference slightly. If you have a straw hat, you can forgo the hat stretcher altogether and directly apply steam to the inside of the hat.",
                "image": "https://www.wikihow.com/images/thumb/6/6e/Stretch-a-Hat-Step-16.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-16.jpg"
            },
            {
                "step": "Step 4",
                "description": "Tighten the hat stretcher knob to make your hat wider. Continue rotating the hat jack knob, allowing the steam and the stretching mechanism to expand your hat’s circumference. Work in small increments as you keep going. As tempting as it may be to widen your hat a lot, you don’t want to warp or damage the material—or worse, make the hat too big!",
                "image": "https://www.wikihow.com/images/thumb/2/24/Stretch-a-Hat-Step-17.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-17.jpg"
            },
            {
                "step": "Step 5",
                "description": "Twist the knob counter-clockwise to remove the hat stretcher. Take the stretcher out of your headwear by rotating the hat jack knob in the opposite direction. Once the mechanism is loose enough, take it out so you can try on the hat. See if the hat stretcher and steam have made your hat a little more comfortable to wear. If not, keep repeating the process. If you’re having repeated trouble getting the hat to stretch out, consider going to a hattery for help.",
                "image": "https://www.wikihow.com/images/thumb/0/02/Stretch-a-Hat-Step-18.jpg/aid11302636-v4-728px-Stretch-a-Hat-Step-18.jpg"
            }
        ]
    }
]